// Notifications
"MESSAGE_TEXT" = "%1$@: %2$@";
"MESSAGE_NOTEXT" = "%1$@ sent you a message";
"MESSAGE_PHOTO" = "%1$@ sent you a photo";
"MESSAGE_VIDEO" = "%1$@ sent you a video";
"MESSAGE_CONTACT" = "%1$@ shared a contact with you";
"MESSAGE_GEO" = "%1$@ sent you a map";
"MESSAGE_DOC" = "%1$@ sent you a file";
"MESSAGE_AUDIO" = "%1$@ sent you a voice note";
"ENCRYPTED_MESSAGE" = "You have a new message%1$@";
"LOCKED_MESSAGE" = "You have a new message%1$@";
"ENCRYPTION_REQUEST" = "New encryption request%1$@";
"ENCRYPTION_ACCEPT" = "Your encryption request was accepted%1$@";
"DC_UPDATE" = "Open this notification to update app settings";

"CHAT_MESSAGE_TEXT" = "%1$@@%2$@: %3$@";
"CHAT_MESSAGE_NOTEXT" = "%1$@ sent a message to the group %2$@";
"CHAT_MESSAGE_PHOTO" = "%1$@ sent a photo to the group %2$@";
"CHAT_MESSAGE_VIDEO" = "%1$@ sent a video to the group %2$@";
"CHAT_MESSAGE_CONTACT" = "%1$@ shared a contact in the group %2$@";
"CHAT_MESSAGE_GEO" = "%1$@ sent a map to the group %2$@";
"CHAT_MESSAGE_DOC" = "%1$@ sent a file to the group %2$@";
"CHAT_MESSAGE_AUDIO" = "%1$@ sent a voice note to the group %2$@";
"CHAT_CREATED" = "%1$@ invited you to the group %2$@";
"CHAT_TITLE_EDITED" = "%1$@ edited the group's %2$@ name";
"CHAT_PHOTO_EDITED" = "%1$@ edited the group's %2$@ photo";
"CHAT_ADD_MEMBER" = "%1$@ invited %3$@ to the group %2$@";
"CHAT_ADD_YOU" = "%1$@ invited you to the group %2$@";
"CHAT_DELETE_YOU" = "%1$@ kicked you from the group %2$@";
"CHAT_DELETE_MEMBER" = "%1$@ kicked %3$@ from the group %2$@";
"CHAT_LEFT" = "%1$@ left the group %2$@";
"CHAT_RETURNED" = "%1$@ returned to the group %2$@";

"MESSAGE_STICKER" = "%1$@ sent you a sticker";
"CHAT_MESSAGE_STICKER" = "%1$@ sent a sticker to the group %2$@";

"CONTACT_JOINED" = "%1$@ joined Telegram!";
"CONTACT_ACTIVATED" = "%1$@ helped you activate your account!";

"AUTH_UNKNOWN" = "Login from a new device %1$@";
"AUTH_REGION" = "Login from a new device %1$@, location: %2$@";

// Common
"Common.OK" = "OK";
"Common.Cancel" = "Cancel";
"Common.Edit" = "Edit";
"Common.edit" = "edit";
"Common.Done" = "Done";
"Common.Next" = "Next";
"Common.Delete" = "Delete";
"Common.Create" = "Create";
"Common.Back" = "Back";
"Common.Close" = "Close";
"Common.Yes" = "Yes";
"Common.No" = "No";
"Common.TakePhotoOrVideo" = "Take Photo or Video";
"Common.TakePhoto" = "Take Photo";
"Common.ChoosePhoto" = "Choose Photo";
"Common.ChooseVideo" = "Choose Video";
"Common.of" = "of";
"Common.Search" = "Search";
"Common.More" = "More";
"Common.Select" = "Select";

// State
"State.connecting" = "connecting";
"State.updating" = "updating";
"State.Connecting" = "Connecting...";
"State.Updating" = "Updating...";
"State.WaitingForNetwork" = "Waiting for network";

// Presence
"Presence.online" = "online";
"Presence.offline" = "offline";
"Presence.invisible" = "invisible";

// Date
"Month.GenJanuary" = "January";
"Month.GenFebruary" = "February";
"Month.GenMarch" = "March";
"Month.GenApril" = "April";
"Month.GenMay" = "May";
"Month.GenJune" = "June";
"Month.GenJuly" = "July";
"Month.GenAugust" = "August";
"Month.GenSeptember" = "September";
"Month.GenOctober" = "October";
"Month.GenNovember" = "November";
"Month.GenDecember" = "December";
"Month.ShortJanuary" = "Jan";
"Month.ShortFebruary" = "Feb";
"Month.ShortMarch" = "Mar";
"Month.ShortApril" = "Apr";
"Month.ShortMay" = "May";
"Month.ShortJune" = "Jun";
"Month.ShortJuly" = "Jul";
"Month.ShortAugust" = "Aug";
"Month.ShortSeptember" = "Sep";
"Month.ShortOctober" = "Oct";
"Month.ShortNovember" = "Nov";
"Month.ShortDecember" = "Dec";
"Weekday.ShortMonday" = "Mon";
"Weekday.ShortTuesday" = "Tue";
"Weekday.ShortWednesday" = "Wed";
"Weekday.ShortThursday" = "Thu";
"Weekday.ShortFriday" = "Fri";
"Weekday.ShortSaturday" = "Sat";
"Weekday.ShortSunday" = "Sun";
"Weekday.Monday" = "Monday";
"Weekday.Tuesday" = "Tuesday";
"Weekday.Wednesday" = "Wednesday";
"Weekday.Thursday" = "Thursday";
"Weekday.Friday" = "Friday";
"Weekday.Saturday" = "Saturday";
"Weekday.Sunday" = "Sunday";

"Time.TodayAt" = "today at %@";
"Time.YesterdayAt" = "yesterday at %@";

"LastSeen.JustNow" = "last seen just now";
"LastSeen.MinutesAgo_1" = "last seen 1 minute ago"; //one
"LastSeen.MinutesAgo_2" = "last seen 2 minutes ago"; //two
"LastSeen.MinutesAgo_3_10" = "last seen %@ minutes ago"; //three to ten
"LastSeen.MinutesAgo_any" = "last seen %@ minutes ago"; // more than ten
"LastSeen.HoursAgo_1" = "last seen 1 hour ago";
"LastSeen.HoursAgo_2" = "last seen 2 hours ago";
"LastSeen.HoursAgo_3_10" = "last seen %@ hours ago";
"LastSeen.HoursAgo_any" = "last seen %@ hours ago";
"LastSeen.TodayAt" = "last seen today at %@";
"LastSeen.YesterdayAt" = "last seen yesterday at %@";
"LastSeen.AtWeekday" = "last seen %@";
"LastSeen.AtDate" = "last seen %@";
"LastSeen.Lately" = "last seen recently";
"LastSeen.WithinAWeek" = "last seen within a week";
"LastSeen.WithinAMonth" = "last seen within a month";
"LastSeen.ALongTimeAgo" = "last seen a long time ago";

"Date.DialogDateFormat" = "{month} {day}";

// Tour
"Tour.Title1" = "Telegram";
"Tour.Text1" = "The world's **fastest** messaging app.\nIt is **free** and **secure**.";

"Tour.Title2" = "Fast";
"Tour.Text2" = "**Telegram** delivers messages\nfaster than any other application.";

"Tour.Title3" = "Powerful";
"Tour.Text3" = "**Telegram** has no limits on\nthe size of your chats and media.";

"Tour.Title4" = "Secure";
"Tour.Text4" = "**Telegram** keeps your messages\nsafe from hacker attacks.";

"Tour.Title5" = "Cloud-Based";
"Tour.Text5" = "**Telegram** lets you access your\nmessages from multiple devices.";

"Tour.Title6" = "Free";
"Tour.Text6" = "**Telegram** is free forever. No ads.\nNo subscription fees.";

"Tour.Title7" = "Private";
"Tour.Text7" = "**Telegram** messages are heavily encrypted and can self-destruct.";

"Tour.StartButton" = "Start Messaging";

// Login
"Login.PhoneAndCountryHelp" = "Please confirm your country code and enter your phone number.";
"Login.CodeHelp" = "We have sent you an SMS with a code to the number\n%@";
"Login.CodeSentInternal" = "Please enter the code you've just received in your previous **Telegram** app";
"Login.HaveNotReceivedCodeInternal" = "Haven't received the code?";
"Login.CodeSentSms" = "We have sent you an SMS with the code";
"Login.Code" = "Code";
"Login.CallRequestState1" = "Telegram will call you in %d:%.2d";
"Login.CallRequestState2" = "Requesting a call from Telegram...";
"Login.CallRequestState3" = "Telegram dialed your number\n[Didn't get the code?]";
"Login.EmailNotConfiguredError" = "Please set up an email account.";
"Login.EmailCodeSubject" = "%@, no code";
"Login.EmailCodeBody" = "My phone number is:\n%@\nI can't get an activation code for Telegram.";
"Login.UnknownError" = "An error occurred. Please try again later";
"Login.InvalidCodeError" = "You have entered an invalid code. Please try again.";
"Login.NetworkError" = "Please check your internet connection and try again.";
"Login.CodeExpiredError" = "Code expired. Please try again.";
"Login.CodeFloodError" = "Limit exceeded. Please try again later.";
"Login.InvalidPhoneError" = "Invalid phone number. Please try again.";
"Login.InvalidFirstNameError" = "Invalid first name. Please try again.";
"Login.InvalidLastNameError" = "Invalid last name. Please try again.";
"Login.InactiveHelp" = "None of your contacts\nuse Telegram yet.\nWe will notify you when they join.\nYou can also invite a friend right away.";
"Login.InviteButton" = "Invite a Friend to Chat";

"Login.PhoneTitle" = "Your Phone";
"Login.PhonePlaceholder" = "Your phone number";
"Login.CountryCode" = "Country Code";
"Login.InvalidCountryCode" = "Invalid Country Code";

"Login.CodeTitle" = "Your Code";

"Login.InfoTitle" = "Your Info";
"Login.InfoAvatarAdd" = "add";
"Login.InfoAvatarPhoto" = "photo";
"Login.InfoFirstNamePlaceholder" = "First name";
"Login.InfoLastNamePlaceholder" = "Last name";
"Login.InfoUpdatePhoto" = "Update Photo";
"Login.InfoDeletePhoto" = "Delete Photo";
"Login.InfoHelp" = "Enter your name and add a profile picture.";

// Login.SelectCountry
"Login.SelectCountry.Title" = "Country";

// Welcome Screen
"WelcomeScreen.Title" = "Get Started";
"WelcomeScreen.Logout" = "Log Out";
"WelcomeScreen.Greeting" = "Welcome, %@!";
"WelcomeScreen.ContactsAccessDisabled" = "Sorry, unable to sync contacts.";
"WelcomeScreen.ContactsAccessHelp" = "Telegram messaging is based on your existing contact list. Please go to your %@'s Settings — Privacy — Contacts and set Telegram to ON.";
"WelcomeScreen.ContactsAccessSettings" = "Settings";
"WelcomeScreen.UpdatingTitle" = "Updating";

// Dialog List
"DialogList.TabTitle" = "Chats";
"DialogList.Title" = "Chats";
"DialogList.SearchLabel" = "Search";
"DialogList.SelectContact" = "Select Contact";
"DialogList.SelectContacts" = "Select Contacts";
"DialogList.Create" = "Create";
"DialogList.NoMessagesTitle" = "You have no conversations yet";
"DialogList.NoMessagesText" = "Start messaging by pressing the pencil button in the top right corner or go to the Contacts section.";
"DialogList.SingleTypingSuffix" = "%@ is typing";
"DialogList.SingleRecordingAudioSuffix" = "%@ is recording audio";
"DialogList.SingleUploadingPhotoSuffix" = "%@ is sending photo";
"DialogList.SingleUploadingVideoSuffix" = "%@ is sending video";
"DialogList.SingleUploadingFileSuffix" = "%@ is sending file";
"DialogList.MultipleTypingSuffix" = "%d are typing";
"DialogList.Typing" = "typing";
"DialogList.ClearHistoryConfirmation" = "Clear History";
"DialogList.DeleteConversationConfirmation" = "Delete and Exit";
"DialogList.AwaitingEncryption" = "Waiting for %@ to get online...";
"DialogList.EncryptionRejected" = "Secret chat cancelled";
"DialogList.EncryptionProcessing" = "Exchanging encryption keys...";
"DialogList.EncryptedChatStartedOutgoing" = "%@ joined your secret chat.";
"DialogList.EncryptedChatStartedIncoming" = "%@ created a secret chat.";
"DialogList.Conversations" = "Conversations";
"DialogList.Messages" = "Messages";

// Compose
"Compose.TokenListPlaceholder" = "Who would you like to message?";
"Compose.NewMessage" = "New Message";
"Compose.NewGroup" = "New Group";
"Compose.NewEncryptedChat" = "New Secret Chat";
"Compose.NewBroadcast" = "Broadcast List";
"Compose.NewBroadcastButton" = "New Broadcast";
"Compose.Recipients" = "Recipients";
"Compose.Create" = "Create";

// Contacts
"Contacts.TabTitle" = "Contacts";
"Contacts.Title" = "Contacts";
"Contacts.Invite" = "Invite";
"Contacts.contact" = "contact";
"Contacts.contacts" = "contacts";
"Contacts.contactsvar" = "contacts";
"Contacts.InvitationText" = "Hey, let's switch to Telegram http://telegram.org/dl";
"Contacts.FailedToSendInvitesMessage" = "An error occurred.";
"Contacts.AccessDeniedError" = "Telegram does not have access to your contacts";
"Contacts.AccessDeniedHelpLandscape" = "Please go to your %@ Settings — Privacy — Contacts.\nThen select ON for Telegram.";
"Contacts.AccessDeniedHelpPortrait" = "Please go to your %@ Settings — Privacy — Contacts. Then select ON for Telegram.";
"Contacts.AccessDeniedHelpON" = "ON";
"Contacts.InviteToTelegram" = "Invite to Telegram";
"Contacts.InviteFriends" = "Invite Friends";
"Contacts.SelectAll" = "Select All";

// Conversation
"Conversation.InputTextPlaceholder" = "Message";
"Conversation.Send" = "Send";
"Conversation.typing" = "typing";
"Conversation.MessageDeliveryFailed" = "Your message was not sent. Tap \"Resend\" to send this message.";
"Conversation.MessageDialogEdit" = "Edit";
"Conversation.MessageDialogRetry" = "Resend";
"Conversation.MessageDialogRetryAll" = "Resend %1$d Messages";
"Conversation.MessageDialogDelete" = "Delete";
"Conversation.LinkDialogOpen" = "Open";
"Conversation.LinkDialogCopy" = "Copy";
"Conversation.EditDelete" = "Delete";
"Conversation.EditForward" = "Forward";
"Conversation.ForwardToPersonFormat" = "Forward to %@?";
"Conversation.ForwardToGroupFormat" = "Forward to %@?";
"Conversation.ForwardTitle" = "Forward";
"Conversation.ForwardChats" = "Chats";
"Conversation.ForwardContacts" = "Contacts";
"Conversation.StatusKickedFromGroup" = "you were kicked from the group";
"Conversation.StatusLeftGroup" = "you have left the group";
"Conversation.StatusTyping" = "typing";
"Conversation.BroadcastTitle" = "Broadcast";
"Conversation.Call" = "Call";
"Conversation.Mute" = "Mute";
"Conversation.Unmute" = "Unmute";
"Conversation.Edit" = "Edit";
"Conversation.Info" = "Info";
"Conversation.Block" = "Block";
"Conversation.Unblock" = "Unblock";
"Conversation.ClearAll" = "Delete All";
"Conversation.Location" = "Location";
"Conversation.Document" = "Send File";
"Conversation.Contact" = "Contact";
"Conversation.BlockUser" = "Block User";
"Conversation.UnblockUser" = "Unblock User";
"Conversation.DeleteGroup" = "Delete this Group";
"Conversation.DeleteChat" = "Delete this Chat";
"Conversation.ClearAllConfirmation" = "Delete all messages?";
"Conversation.SearchImages" = "Search Images";
"Conversation.UnsupportedMedia" = "This message is not supported on your version of Telegram. Update the app to view:\nhttp://telegram.org/update";
"Conversation.EncryptionWaiting" = "Waiting for %@ to get online...";
"Conversation.EncryptionProcessing" = "Exchanging encryption keys...";
"Conversation.SupportPlaceholder" = "Got a question about Telegram?";
"Conversation.EmptyPlaceholder" = "No messages here yet...";
"Conversation.EncryptedPlaceholderTitleIncoming" = "%@ invited you to join a secret chat.";
"Conversation.EncryptedPlaceholderTitleOutgoing" = "You have invited %@ to join a secret chat.";
"Conversation.EncryptedDescriptionTitle" = "Secret chats:";
"Conversation.EncryptedDescription1" = "Use end-to-end encryption";
"Conversation.EncryptedDescription2" = "Leave no trace on our servers";
"Conversation.EncryptedDescription3" = "Have a self-destruct timer";
"Conversation.EncryptedDescription4" = "Do not allow forwarding";
"Conversation.EncryptedForwardingAlert" = "Sorry, you cannot forward a message from a secret chat.";
"Conversation.ContextMenuCopy" = "Copy";
"Conversation.ContextMenuDelete" = "Delete";
"Conversation.ContextMenuForward" = "Forward";
"Conversation.ContextMenuMore" = "More...";

"Conversation.StatusMembers_1" = "1 member";
"Conversation.StatusMembers_2" = "2 members";
"Conversation.StatusMembers_3_10" = "%@ members";
"Conversation.StatusMembers_any" = "%@ members";

"Conversation.StatusRecipients_1" = "1 recipient";
"Conversation.StatusRecipients_2" = "2 recipients";
"Conversation.StatusRecipients_3_10" = "%@ recipients";
"Conversation.StatusRecipients_any" = "%@ recipients";

"Conversation.StatusOnline_1" = "1 online";
"Conversation.StatusOnline_2" = "2 online";
"Conversation.StatusOnline_3_10" = "%@ online";
"Conversation.StatusOnline_any" = "%@ online";

"Conversation.UnreadMessages" = "Unread Messages";
"Conversation.InfoGroup" = "Group";
"Conversation.InfoPrivate" = "Contact";
"Conversation.InfoBroadcastList" = "List";

// Notification
"Notification.RenamedChat" = "%@ renamed group";
"Notification.ChangedGroupPhoto" = "%@ changed group photo";
"Notification.RemovedGroupPhoto" = "%@ removed group photo";
"Notification.ChangedUserPhoto" = "%@ added a new profile photo";
"Notification.RemovedUserPhoto" = "%@ removed profile photo";
"Notification.JoinedChat" = "%@ joined the group";
"Notification.Invited" = "%@ invited %@";
"Notification.LeftChat" = "%@ left the group";
"Notification.Kicked" = "%@ kicked %@";
"Notification.CreatedChat" = "%@ created a group";
"Notification.CreatedBroadcastList" = "You created a broadcast list";
"Notification.CreatedChatWithTitle" = "%@ created the group \"%@\"";
"Notification.Joined" = "%@ joined Telegram";
"Notification.ChangedGroupName" = "%@ changed group name to \"%@\"";
"Notification.NewAuthDetected" = "%1$@,\nWe detected a login into your account from a new device on %2$@, %3$@ at %4$@\n\nDevice: %5$@\nLocation: %6$@\n\nIf this wasn't you, you can go to Settings — Privacy and Security — Terminate all sessions.\n\nThanks,\nThe Telegram Team";
"Notification.EncryptedChatRequested" = "Secret chat requested";
"Notification.EncryptedChatAccepted" = "Secret chat started";
"Notification.MessageLifetimeChanged" = "%1$@ set the self-destruct timer to %2$@";
"Notification.MessageLifetimeChangedOutgoing" = "You set the self-destruct timer to %1$@";
"Notification.MessageLifetimeRemoved" = "%1$@ disabled the self-destruct timer";
"Notification.MessageLifetimeRemovedOutgoing" = "You disabled the self-destruct timer";
"Notification.MessageLifetime2s" = "2 seconds";
"Notification.MessageLifetime5s" = "5 seconds";
"Notification.MessageLifetime1m" = "1 minute";
"Notification.MessageLifetime1h" = "1 hour";
"Notification.MessageLifetime1d" = "1 day";
"Notification.MessageLifetime1w" = "1 week";

// Message
"Message.Photo" = "Photo";
"Message.Video" = "Video";
"Message.Location" = "Location";
"Message.Contact" = "Contact";
"Message.File" = "File";
"Message.Sticker" = "Sticker";
"Message.Audio" = "Audio";
"Message.ForwardedMessage" = "Forwarded Message\nFrom: %@";
"Message.SharedContact" = "Shared Contact";

// Conversation Profile
"ConversationProfile.ErrorCreatingConversation" = "An error occurred";
"ConversationProfile.UserLeftChatError" = "Sorry, %@ decided to leave this group, so you cannot invite him back here.";
"ConversationProfile.UnknownAddMemberError" = "An unexpected error has occurred. Our wizards have been notified and will fix the problem soon. Sorry.";
"ConversationProfile.UsersTooMuchError" = "Sorry, this group is full. You cannot add any more members here.";

"ConversationProfile.LeaveDeleteAndExit" = "Delete and Exit";

"Conversation.DownloadPhoto" = "Download Photo";
"Conversation.ViewPhoto" = "View Photo";
"Conversation.PlayVideo" = "Play Video";
"Conversation.Play" = "Play";
"Conversation.Stop" = "Stop";
"Conversation.ViewFile" = "View File";
"Conversation.Download" = "Download";
"Conversation.DownloadMegabytes" = "Download %.1fMb";
"Conversation.DownloadKilobytes" = "Download %dKb";
"Conversation.Megabytes" = "%.1fMb";
"Conversation.Kilobytes" = "%dKb";
"Conversation.DownloadProgressMegabytes" = "%1$.1fMb / %2$.1fMb";
"Conversation.DownloadProgressKilobytes" = "%1$dKb / %2$dKb";
"Conversation.ViewLocation" = "View Location";
"Conversation.SearchWebImages" = "Find Images";
"Conversation.ShareMyContactInfo" = "Share My Contact Info";
"Conversation.AddContact" = "Add Contact";
"Conversation.SendMessage" = "Send Message";
"Conversation.EncryptionCanceled" = "Secret chat cancelled";
"Conversation.DeleteOneMessage" = "Delete Message";
"Conversation.DeleteManyMessages" = "Delete Messages";
"Conversation.View" = "View";
"Conversation.Download" = "Download";
"Conversation.SlideToCancel" = "Slide to cancel";
"Conversation.ApplyLocalization" = "Apply Localization";
"Conversation.OpenFile" = "Open File";
"Conversation.MicrophoneAccessDisabled" = "Telegram needs access to your microphone for voice messages. Please go to Settings — Privacy — Microphone and set Telegram to ON.";

// Media Picker
"MediaPicker.Send" = "Send";
"MediaPicker.Choose" = "Choose";
"SearchImages.SearchImages" = "Search Images";
"SearchImages.Title" = "Albums";
"MediaPicker.CameraRoll" = "Camera Roll";
"SearchImages.NoImagesFound" = "No images found";
"MediaPicker.AccessDeniedError" = "Telegram does not have access to your photos";
"MediaPicker.AccessDeniedHelp" = "Please go to your %@ Settings — Privacy — Photos.\nThen select ON for Telegram.";
"SearchImages.Downloading#Kb" = "Downloading %d Kb";
"SearchImages.Downloading#Mb" = "Downloading %d Mb";
"SearchImages.ImageNofM" = "Image %1$@ of %2$@";
"SearchImages.DownloadCancelled" = "Download cancelled";
"SearchImages.ErrorDownloadingImage" = "Error downloading image";
"SearchImages.SkipImage" = "Skip Image";
"SearchImages.RetryDownload" = "Retry Download";

// User Profile
"Profile.ImageUploadError" = "An error occurred. Please try again later.";
"Profile.PhonebookAccessDisabled" = "To make this feature work, please go to your iPhone's Settings — Privacy — Contacts and select ON for Telegram.";
"Profile.CreateEncryptedChatError" = "An error occurred.";
"Profile.CreateEncryptedChatOutdatedError" = "Cannot create a secret chat with %@.\n%@ is using an older version of Telegram and needs to update first.";
"Profile.CreateNewContact" = "Create New Contact";
"Profile.AddToExisting" = "Add to Existing Contact";
"Profile.EncryptionKey" = "Encryption Key";
"Profile.MessageLifetime" = "Self-Destruct Timer";
"Profile.MessageLifetimeForever" = "Off";
"Profile.MessageLifetime2s" = "2s";
"Profile.MessageLifetime5s" = "5s";
"Profile.MessageLifetime1m" = "1m";
"Profile.MessageLifetime1h" = "1h";
"Profile.MessageLifetime1d" = "1d";
"Profile.MessageLifetime1w" = "1w";
"Profile.ShareContactButton" = "Share Contact";
"Profile.ShareContactPersonFormat" = "Send contact to %@?";
"Profile.ShareContactGroupFormat" = "Send contact to %@?";

// User Info
"UserInfo.Title" = "Info";
"UserInfo.FirstNamePlaceholder" = "First Name";
"UserInfo.LastNamePlaceholder" = "Last Name";
"UserInfo.GenericPhoneLabel" = "mobile";
"UserInfo.SendMessage" = "Send Message";
"UserInfo.AddContact" = "Add Contact";
"UserInfo.ShareContact" = "Share Contact";
"UserInfo.StartSecretChat" = "Start Secret Chat";
"UserInfo.DeleteContact" = "Delete Contact";
"UserInfo.CreateNewContact" = "Create New Contact";
"UserInfo.AddToExisting" = "Add to Existing";
"UserInfo.AddPhone" = "add phone";
"UserInfo.NotificationsEnabled" = "Enabled";
"UserInfo.NotificationsDisabled" = "Disabled";
"UserInfo.NotificationsEnable" = "Enable";
"UserInfo.NotificationsDisable" = "Disable";
"UserInfo.Invite" = "Invite to Telegram";

// New Contact
"NewContact.Title" = "New Contact";

// Phone Label
"PhoneLabel.Title" = "Label";

// Secret Chat
"SecretChat.Title" = "Secret Chat";

// Group Info
"GroupInfo.Title" = "Group Info";
"GroupInfo.GroupNamePlaceholder" = "Group Name";
"GroupInfo.BroadcastListNamePlaceholder" = "List Name";
"GroupInfo.SetGroupPhoto" = "Set Group Photo";
"GroupInfo.SetGroupPhotoStop" = "Stop";
"GroupInfo.SetGroupPhotoDelete" = "Delete Photo";
"GroupInfo.Notifications" = "Notifications";
"GroupInfo.Sound" = "Sound";
"GroupInfo.SharedMedia" = "Shared Media";
"GroupInfo.SharedMediaNone" = "None";
"GroupInfo.DeleteAndExit" = "Delete and Exit";
"GroupInfo.DeleteAndExitConfirmation" = "You will not be able to join this group again.";
"GroupInfo.ParticipantCount_1" = "1 MEMBER";
"GroupInfo.ParticipantCount_2" = "2 MEMBERS";
"GroupInfo.ParticipantCount_3_10" = "%@ MEMBERS";
"GroupInfo.ParticipantCount_any" = "%@ MEMBERS";
"GroupInfo.AddParticipant" = "Add Participant...";
"GroupInfo.AddParticipantTitle" = "Contacts";
"GroupInfo.AddParticipantConfirmation" = "Add %@ to the group?";
"GroupInfo.KickedStatus" = "You were kicked from the group";
"GroupInfo.LeftStatus" = "You have left the group";

// Encryption Key
"EncryptionKey.Title" = "Encryption Key";
"EncryptionKey.Description" = "This image is a visualization of the encryption key for this secret chat with %1$@.\n\nIf this image looks the same on %2$@'s phone, your chat is 200%% secure.\n\nLearn more at telegram.org";

// Conversation media
"ConversationMedia.Title" = "Media";
"ConversationMedia.EmptyTitle" = "No Photos or Videos";

// Preview
"Preview.VideoNotYetDownloaded" = "Download the video first.";
"Preview.GroupPhotoTitle" = "Group Photo";
"Preview.ProfilePhotoTitle" = "Profile Photo";
"Preview.LoadingVideo" = "loading video...";
"Preview.LoadingImage" = "loading full image...";
"Preview.LoadingImages" = "loading full images...";
"Preview.DeletePhoto" = "Delete Photo";
"Preview.DeleteVideo" = "Delete Video";
"Preview.ForwardViaTelegram" = "Forward via Telegram";
"Preview.SaveToCameraRoll" = "Save to Camera Roll";

// Map
"Map.ChooseLocationTitle" = "Location";
"Map.MapTitle" = "Map";
"Map.Send" = "Send";
"Map.Map" = "Map";
"Map.Satellite" = "Satellite";
"Map.Hybrid" = "Hybrid";
"Map.AccessDeniedError" = "To make this feature work, please turn on Location Services for Telegram in your iPhone's Privacy Settings.";
"Map.ForwardViaTelegram" = "Forward via Telegram";
"Map.GetDirections" = "Get Directions";
"Map.OpenInGoogleMaps" = "Open in Google Maps";

// Web
"Web.Error" = "Couldn't load page";
"Web.OpenExternal" = "Open in Safari";
"Web.CopyLink" = "Copy Link";

// Document
"Document.TargetConfirmationFormat" = "Send file ({size}) to {target}?";

// Dialog List
"DialogList.You" = "You";

// Settings
"Settings.TabTitle" = "Settings";
"Settings.SetProfilePhoto" = "Set Profile Photo";
"Settings.Logout" = "Log Out";
"Settings.Title" = "Settings";
"Settings.NotificationsAndSounds" = "Notifications and Sounds";
"Settings.ChatSettings" = "Chat Settings";
"Settings.BlockedUsers" = "Blocked Users";
"Settings.ChatBackground" = "Chat Background";
"Settings.Support" = "Ask a Question";
"Settings.FAQ" = "Telegram FAQ";
"Settings.FAQ_URL" = "http://telegram.org/faq#general";
"Settings.FAQ_Intro" = "Please note that Telegram Support is done by volunteers. We try to respond as quickly as possible, but it may take a while.Please take a look at the Telegram FAQ: it has important troubleshooting tips and answers to most questions.";
"Settings.FAQ_Button" = "FAQ";
"Settings.SaveIncomingPhotos" = "Save Incoming Photos";
"Settings.SaveIncomingPhotosHelp" = "Save incoming photos to the Camera Roll.";
"Settings.LogoutError" = "An error occurred. Please try again later.";

// Notifications and Sounds
"Notifications.Title" = "Notifications";
"Notifications.MessageNotifications" = "MESSAGE NOTIFICATIONS";
"Notifications.MessageNotificationsAlert" = "Alert";
"Notifications.MessageNotificationsPreview" = "Message Preview";
"Notifications.MessageNotificationsSound" = "Sound";
"Notifications.MessageNotificationsHelp" = "You can set custom notifications for specific users on their Info page.";

"Notifications.GroupNotifications" = "GROUP NOTIFICATIONS";
"Notifications.GroupNotificationsAlert" = "Alert";
"Notifications.GroupNotificationsPreview" = "Message Preview";
"Notifications.GroupNotificationsSound" = "Sound";
"Notifications.GroupNotificationsHelp" = "You can set custom notifications for specific groups on the Group Info page.";

"Notifications.TextTone" = "Text Tone";
"Notifications.AlertTones" = "ALERT TONES";
"Notifications.ClassicTones" = "CLASSIC";

"Notifications.InAppNotifications" = "IN-APP NOTIFICATIONS";
"Notifications.InAppNotificationsSounds" = "In-App Sounds";
"Notifications.InAppNotificationsVibrate" = "In-App Vibrate";
"Notifications.InAppNotificationsPreview" = "In-App Preview";

"Notifications.Reset" = "Reset";
"Notifications.ResetAllNotifications" = "Reset All Notifications";
"Notifications.ResetAllNotificationsHelp" = "Undo all custom notification settings for all your contacts and groups.";

// Chat Settings
"ChatSettings.Title" = "Chat Settings";
"ChatSettings.Appearance" = "APPEARANCE";
"ChatSettings.TextSize" = "Text Size";
"ChatSettings.TextSizeUnits" = "pt";
"ChatSettings.AutomaticPhotoDownload" = "AUTOMATIC PHOTO DOWNLOAD";
"ChatSettings.AutomaticAudioDownload" = "AUTOMATIC AUDIO DOWNLOAD";
"ChatSettings.PrivateChats" = "Private Chats";
"ChatSettings.Groups" = "Groups";
"ChatSettings.Security" = "SECURITY";
"ChatSettings.ClearOtherSessions" = "Terminate all other sessions";
"ChatSettings.ClearOtherSessionsHelp" = "Logs out all devices except for this one.";
"ChatSettings.ClearOtherSessionsConfirmation" = "Are you sure you want to log out all devices except for the current one?";
"ChatSettings.ClearOtherSessionsFailed" = "An error occurred.";
"ChatSettings.Language" = "LANGUAGE";
"ChatSettings.RevertLanguage" = "Revert Language";
"ChatSettings.Cache" = "CACHE";

// Usage
"Cache.Title" = "Cache Settings";
"Cache.ClearCache" = "Clear Cache";
"Cache.KeepMedia" = "Keep Media";
"Cache.Help" = "Photos, videos and other files from cloud chats that you have **not accessed** during this period will be removed from this device to save disk space.\n\nAll media will stay in the Telegram cloud and can be re-downloaded if you need it again.";

// Blocked Users
"BlockedUsers.Title" = "Blocked";
"BlockedUsers.SelectUserTitle" = "Block User";
"BlockedUsers.AlreadyBlocked" = "This user is already blocked";
"BlockedUsers.BlockUser" = "Block User";
"BlockedUsers.BlockFormat" = "Block %@?";
"BlockedUsers.BlockTitle" = "Block";
"BlockedUsers.LeavePrefix" = "Leave ";
"BlockedUsers.Info" = "Blocked users can't send you messages or add you to groups. They will not see your profile pictures, online and last seen status.";
"BlockedUsers.AddNew" = "Add New...";
"BlockedUsers.Unblock" = "Unblock";

// Wallpaper
"Wallpaper.Title" = "Chat Background";
"Wallpaper.PhotoLibrary" = "Photo Library";
"Wallpaper.Set" = "Set";
"Wallpaper.Wallpaper" = "Wallpaper";

// Update
"Update.Update" = "Update";

// Service
"Service.LocalizationDownloadError" = "Couldn't download localization file. Please check your internet connection and try again.";
"Service.ApplyLocalization" = "Apply Localization?";
"Service.ApplyLocalizationWithWarnings" = "%@\n\nApply Localization?";

"Notification.SecretChatMessageScreenshot" = "%@ took a screenshot!";
"Notification.SecretChatScreenshot" = "Screenshot taken!";

// Broadcast Lists
"DialogList.Broadcast" = "Broadcast";
"BroadcastLists.Title" = "Broadcast Lists";
"BroadcastLists.NoListsYet" = "No Lists Yet";
"BroadcastLists.NoListsText" = "With broadcast lists you can easily send messages to many people at once.";

// Broadcast List
"BroadcastListInfo.Title" = "Broadcast List";
"BroadcastListInfo.AddRecipient" = "Add Recipient";

// Video
"VideoPreview.OptionSD" = "Normal Size (%@)";
"VideoPreview.OptionHD" = "High Definition (%@)";

"ChatSettings.AutoPlayAudio" = "Autoplay Audio";

"Settings.LogoutConfirmationTitle" = "Log out?";
"Settings.LogoutConfirmationText" = "\nNote that you can seamlessly use Telegram on all your devices at once.\n\nRemember, logging out kills all your Secret Chats.";

"Login.PadPhoneHelp" = "\nYou can use your main mobile number to log in to Telegram on all devices.\nDon't use your iPad's SIM number here — we'll need to send you an SMS.\n\nIs this number correct?\n{number}";
"Login.PadPhoneHelpTitle" = "Your Number";

"MessageTimer.Custom" = "Custom";
"MessageTimer.Title" = "Custom Timer";

"MessageTimer.Forever" = "Forever";

"MessageTimer.Seconds_1" = "%@ second";
"MessageTimer.Seconds_2" = "%@ seconds";
"MessageTimer.Seconds_3_10" = "%@ seconds";
"MessageTimer.Seconds_any" = "%@ seconds";
"MessageTimer.Minutes_1" = "%@ minute";
"MessageTimer.Minutes_2" = "%@ minutes";
"MessageTimer.Minutes_3_10" = "%@ minutes";
"MessageTimer.Minutes_any" = "%@ minutes";
"MessageTimer.Hours_1" = "%@ hour";
"MessageTimer.Hours_2" = "%@ hours";
"MessageTimer.Hours_3_10" = "%@ hours";
"MessageTimer.Hours_any" = "%@ hours";
"MessageTimer.Days_1" = "%@ day";
"MessageTimer.Days_2" = "%@ days";
"MessageTimer.Days_3_10" = "%@ days";
"MessageTimer.Days_any" = "%@ days";
"MessageTimer.Weeks_1" = "%@ week";
"MessageTimer.Weeks_2" = "%@ weeks";
"MessageTimer.Weeks_3_10" = "%@ weeks";
"MessageTimer.Weeks_any" = "%@ weeks";
"MessageTimer.Months_1" = "%@ month";
"MessageTimer.Months_2" = "%@ months";
"MessageTimer.Months_3_10" = "%@ months";
"MessageTimer.Months_any" = "%@ months";
"MessageTimer.Years_1" = "%@ year";
"MessageTimer.Years_2" = "%@ years";
"MessageTimer.Years_3_10" = "%@ years";
"MessageTimer.Years_any" = "%@ years";

"MessageTimer.ShortSeconds_1" = "%@s";
"MessageTimer.ShortSeconds_2" = "%@s";
"MessageTimer.ShortSeconds_3_10" = "%@s";
"MessageTimer.ShortSeconds_any" = "%@s";
"MessageTimer.ShortMinutes_1" = "%@m";
"MessageTimer.ShortMinutes_2" = "%@m";
"MessageTimer.ShortMinutes_3_10" = "%@m";
"MessageTimer.ShortMinutes_any" = "%@m";
"MessageTimer.ShortHours_1" = "%@h";
"MessageTimer.ShortHours_2" = "%@h";
"MessageTimer.ShortHours_3_10" = "%@h";
"MessageTimer.ShortHours_any" = "%@h";
"MessageTimer.ShortDays_1" = "%@d";
"MessageTimer.ShortDays_2" = "%@d";
"MessageTimer.ShortDays_3_10" = "%@d";
"MessageTimer.ShortDays_any" = "%@d";
"MessageTimer.ShortWeeks_1" = "%@w";
"MessageTimer.ShortWeeks_2" = "%@w";
"MessageTimer.ShortWeeks_3_10" = "%@w";
"MessageTimer.ShortWeeks_any" = "%@w";

"Activity.UploadingPhoto" = "sending photo";
"Activity.UploadingVideo" = "sending video";
"Activity.UploadingDocument" = "sending file";
"Activity.RecordingAudio" = "recording audio";
"Activity.Location" = "picking location";

"Service.NetworkConfigurationUpdatedMessage" = "Connection settings updated successfully.";

"Compatibility.SecretMediaVersionTooLow" = "%@ is using an older version of Telegram, so secret photos will be shown in compatibility mode.\n\nOnce %@ updates Telegram, photos with timers for 1 minute or less will start working in 'Tap and hold to view' mode, and you will be notified whenever the other party takes a screenshot.";

"Contacts.GlobalSearch" = "Global Search";
"Profile.Username" = "username";
"Settings.Username" = "Username";
"Settings.UsernameEmpty" = "None";

"Username.Title" = "Username";
"Username.Placeholder" = "Your Username";
"Username.Help" = "You can choose a username on **Telegram**. If you do, other people will be able to find you by this username and contact you without knowing your phone number.\n\nYou can use **a-z**, **0-9** and underscores. Minimum length is **5** characters.";
"Username.InvalidTooShort" = "A username must have at least 5 characters.";
"Username.InvalidStartsWithNumber" = "Sorry, a username can't start with a number.";
"Username.InvalidCharacters" = "Sorry, this username is invalid.";
"Username.InvalidTaken" = "Sorry, this username is already taken.";

"Username.CheckingUsername" = "Checking username...";
"Username.UsernameIsAvailable" = "%@ is available.";

"WebSearch.Images" = "Images";
"WebSearch.GIFs" = "GIFs";
"WebSearch.RecentSectionTitle" = "Recent";
"WebSearch.RecentSectionClear" = "Clear";
"WebSearch.RecentClearConfirmation" = "Are you sure you want to clear recent images?";

"Settings.PrivacySettings" = "Privacy and Security";

"UserCount_1" = "1 user";
"UserCount_2" = "2 users";
"UserCount_3_10" = "%@ users";
"UserCount_any" = "%@ users";

"PrivacySettings.Title" = "Privacy and Security";

"PrivacySettings.PrivacyTitle" = "PRIVACY";
"PrivacySettings.LastSeen" = "Last Seen";
"PrivacySettings.LastSeenEverybody" = "Everybody";
"PrivacySettings.LastSeenContacts" = "My Contacts";
"PrivacySettings.LastSeenNobody" = "Nobody";

"PrivacySettings.LastSeenEverybodyMinus" = "Everybody (-%@)";
"PrivacySettings.LastSeenContactsPlus" = "My Contacts (+%@)";
"PrivacySettings.LastSeenContactsMinus" = "My Contacts (-%@)";
"PrivacySettings.LastSeenContactsMinusPlus" = "My Contacts (-%@, +%@)";
"PrivacySettings.LastSeenNobodyPlus" = "Nobody (+%@)";

"PrivacySettings.SecurityTitle" = "SECURITY";

"PrivacySettings.DeleteAccountTitle" = "DELETE MY ACCOUNT";
"PrivacySettings.DeleteAccountIfAwayFor" = "If Away For";
"PrivacySettings.DeleteAccountHelp" = "If you do not log in at least once within this period, your account will be deleted along with all groups, messages and contacts.";
"PrivacySettings.DeleteAccountNowConfirmation" = "Delete your account?";
"PrivacySettings.DeleteAccountNever" = "Never";

"PrivacyLastSeenSettings.Title" = "Last Seen";
"PrivacyLastSeenSettings.LastSeenHelp" = "Change who can see your Last Seen time.";
"PrivacyLastSeenSettings.CustomHelp" = "Important: you won't be able to see Last Seen times for people with whom you don't share your Last Seen time. Approximate last seen will be shown instead (recently, within a week, within a month).";
"PrivacyLastSeenSettings.AlwaysShareWith" = "Always Share With";
"PrivacyLastSeenSettings.NeverShareWith" = "Never Share With";
"PrivacyLastSeenSettings.CustomShareSettingsHelp" = "These settings will override the values above.";

"PrivacyLastSeenSettings.CustomShareSettings.Delete" = "Delete";
"PrivacyLastSeenSettings.AlwaysShareWith.Title" = "Always Share";
"PrivacyLastSeenSettings.AlwaysShareWith.Placeholder" = "Always share with users...";
"PrivacyLastSeenSettings.NeverShareWith.Title" = "Never Share";
"PrivacyLastSeenSettings.NeverShareWith.Placeholder" = "Never share with users...";
"PrivacyLastSeenSettings.EmpryUsersPlaceholder" = "Add Users";
"PrivacyLastSeenSettings.AddUsers_1" = "Add 1 user to this list?";
"PrivacyLastSeenSettings.AddUsers_2" = "Add 2 users to this list?";
"PrivacyLastSeenSettings.AddUsers_3_10" = "Add %@ users to this list?";
"PrivacyLastSeenSettings.AddUsers_any" = "Add %@ users to this list?";

"PrivacySettings.FloodControlError" = "Sorry, too many requests. Unable to change privacy settings now, please wait.";


"ImagePicker.NoPhotos" = "No Photos";
"ImagePicker.NoVideos" = "No Videos";

"Settings.OpenSystemPrivacySettings" = "Open %@ Settings";

// Photo Editor
"PhotoEditor.DiscardChanges" = "Discard Changes";
"PhotoEditor.RevertToOriginal" = "Revert to Original";
"PhotoEditor.RevertMessage" = "Revert to original will remove all edits made to this photo. This action cannot be undone.";

"PhotoEditor.Original" = "Original";
"PhotoEditor.Current" = "Current";

"PhotoEditor.CropReset" = "RESET";
"PhotoEditor.CropAuto" = "AUTO";
"PhotoEditor.CropAspectRatioOriginal" = "Original";
"PhotoEditor.CropAspectRatioSquare" = "Square";

"PhotoEditor.EnhanceTool" = "Enhance";
"PhotoEditor.ExposureTool" = "Exposure";
"PhotoEditor.ContrastTool" = "Contrast";
"PhotoEditor.WarmthTool" = "Warmth";
"PhotoEditor.SaturationTool" = "Saturation";
"PhotoEditor.HighlightsTool" = "Highlights";
"PhotoEditor.ShadowsTool" = "Shadows";
"PhotoEditor.VignetteTool" = "Vignette";
"PhotoEditor.GrainTool" = "Grain";
"PhotoEditor.BlurTool" = "Blur";
"PhotoEditor.SharpenTool" = "Sharpen";

"PhotoEditor.BlurToolOff" = "Off";
"PhotoEditor.BlurToolRadial" = "Radial";
"PhotoEditor.BlurToolLinear" = "Linear";

"PhotoEditor.Set" = "Set";

// Camera
"Camera.PhotoMode" = "PHOTO";
"Camera.VideoMode" = "VIDEO";
"Camera.FlashOff" = "Off";
"Camera.FlashOn" = "On";
"Camera.FlashAuto" = "Auto";
"Camera.Retake" = "Retake";

"Settings.PhoneNumber" = "Phone Number";

"PhoneNumberHelp.Help" = "You can change your Telegram number here. Your account and all your cloud data — messages, media, contacts, etc. will be moved to the new number.\n\n**Important:** all your Telegram contacts will get your **new number** added to their address book, provided they had your old number and you haven't blocked them in Telegram.";
"PhoneNumberHelp.Alert" = "All your Telegram contacts will get your new number added to their address book, provided they had your old number and you haven't blocked them in Telegram.";
"PhoneNumberHelp.ChangeNumber" = "Change Number";

"ChangePhoneNumberNumber.Title" = "Change Number";
"ChangePhoneNumberNumber.NewNumber" = "NEW NUMBER";
"ChangePhoneNumberNumber.Help" = "We will send an SMS with a confirmation code to your new number.";
"ChangePhoneNumberNumber.NumberPlaceholder" = "Enter your new number";

"ChangePhoneNumberCode.Code" = "YOUR CODE";
"ChangePhoneNumberCode.CodePlaceholder" = "Code";
"ChangePhoneNumberCode.Help" = "We have sent you an SMS with the code";
"ChangePhoneNumberCode.CallTimer" = "Telegram will call you in %@";
"ChangePhoneNumberCode.RequestingACall" = "Requesting a call from Telegram...";
"ChangePhoneNumberCode.Called" = "Telegram dialed your number";

"PrivacySettings.Password" = "Password";

"PasswordSettings.Title" = "Password";

"LoginPassword.Title" = "Enter Password";
"LoginPassword.PasswordPlaceholder" = "Password";
"LoginPassword.InvalidPasswordError" = "Invalid password. Please try again.";
"LoginPassword.FloodError" = "Limit exceeded. Please try again later.";
"LoginPassword.ForgotPassword" = "Forgot password";

"QuickSend.Photos_1" = "Send 1 Photo";
"QuickSend.Photos_2" = "Send 2 Photos";
"QuickSend.Photos_3_10" = "Send %@ Photos";
"QuickSend.Photos_any" = "Send %@ Photos";

"Share.Title" = "Share";
"Forward.ConfirmMultipleFiles_1" = "Send 1 file to {target}?";
"Forward.ConfirmMultipleFiles_2" = "Send 2 files to {target}?";
"Forward.ConfirmMultipleFiles_3_10" = "Send %@ files to {target}?";
"Forward.ConfirmMultipleFiles_any" = "Send %@ files to {target}?";

"PrivacySettings.TouchIdTitle" = "TouchID";
"PrivacySettings.TouchIdEnable" = "Enable";

"Notification.Reply" = "Reply";
"Notification.Mute8h" = "Mute for 8 hours";
"Notification.Mute8hMin" = "Mute for 8h";
"Conversation.ContextMenuShare" = "Share";

"SharedMedia.TitleAll" = "Shared Media";
"SharedMedia.TitlePhoto" = "Photos";
"SharedMedia.TitleVideo" = "Videos";
"SharedMedia.TitleFile" = "Files";

"SharedMedia.All" = "All";
"SharedMedia.Incoming" = "Received";
"SharedMedia.Outgoing" = "Sent";

"SharedMedia.Photo_1" = "1 photo";
"SharedMedia.Photo_2" = "2 photos";
"SharedMedia.Photo_3_10" = "%@ photos";
"SharedMedia.Photo_any" = "%@ photos";

"SharedMedia.Video_1" = "1 video";
"SharedMedia.Video_2" = "2 videos";
"SharedMedia.Video_3_10" = "%@ videos";
"SharedMedia.Video_any" = "%@ videos";

"SharedMedia.File_1" = "1 file";
"SharedMedia.File_2" = "2 files";
"SharedMedia.File_3_10" = "%@ files";
"SharedMedia.File_any" = "%@ files";

"SharedMedia.Generic_1" = "1 media file";
"SharedMedia.Generic_2" = "2 media files";
"SharedMedia.Generic_3_10" = "%@ media files";
"SharedMedia.Generic_any" = "%@ media files";

"FileSize.B" = "%@ B";
"FileSize.KB" = "%@ KB";
"FileSize.MB" = "%@ MB";

"DownloadingStatus" = "Downloading %@ of %@";

"Time.MonthOfYear_1" = "January %@";
"Time.MonthOfYear_2" = "February %@";
"Time.MonthOfYear_3" = "March %@";
"Time.MonthOfYear_4" = "April %@";
"Time.MonthOfYear_5" = "May %@";
"Time.MonthOfYear_6" = "June %@";
"Time.MonthOfYear_7" = "July %@";
"Time.MonthOfYear_8" = "August %@";
"Time.MonthOfYear_9" = "September %@";
"Time.MonthOfYear_10" = "October %@";
"Time.MonthOfYear_11" = "November %@";
"Time.MonthOfYear_12" = "December %@";

"Time.PreciseDate_1" = "Jan %1$@, %2$@ at %3$@";
"Time.PreciseDate_2" = "Feb %1$@, %2$@ at %3$@";
"Time.PreciseDate_3" = "Mar %1$@, %2$@ at %3$@";
"Time.PreciseDate_4" = "Apr %1$@, %2$@ at %3$@";
"Time.PreciseDate_5" = "May %1$@, %2$@ at %3$@";
"Time.PreciseDate_6" = "Jun %1$@, %2$@ at %3$@";
"Time.PreciseDate_7" = "Jul %1$@, %2$@ at %3$@";
"Time.PreciseDate_8" = "Aug %1$@, %2$@ at %3$@";
"Time.PreciseDate_9" = "Sep %1$@, %2$@ at %3$@";
"Time.PreciseDate_10" = "Oct %1$@, %2$@ at %3$@";
"Time.PreciseDate_11" = "Nov %1$@, %2$@ at %3$@";
"Time.PreciseDate_12" = "Dec %1$@, %2$@ at %3$@";

"MuteFor.Minutes_1" = "Mute for 1 minute";
"MuteFor.Minutes_2" = "Mute for 2 minutes";
"MuteFor.Minutes_3_10" = "Mute for %@ minutes";
"MuteFor.Minutes_any" = "Mute for %@ minutes";

"MuteFor.Hours_1" = "Mute for 1 hour";
"MuteFor.Hours_2" = "Mute for 2 hours";
"MuteFor.Hours_3_10" = "Mute for %@ hours";
"MuteFor.Hours_any" = "Mute for %@ hours";

"MuteFor.Days_1" = "Mute for 1 day";
"MuteFor.Days_2" = "Mute for 2 days";
"MuteFor.Days_3_10" = "Mute for %@ days";
"MuteFor.Days_any" = "Mute for %@ days";

"MuteFor.Weeks_1" = "Mute for 1 week";
"MuteFor.Weeks_2" = "Mute for 2 weeks";
"MuteFor.Weeks_3_10" = "Mute for %@ weeks";
"MuteFor.Weeks_any" = "Mute for %@ weeks";

"MuteExpires.Minutes_1" = "in 1 minute";
"MuteExpires.Minutes_2" = "in 2 minutes";
"MuteExpires.Minutes_3_10" = "in %@ minutes";
"MuteExpires.Minutes_any" = "in %@ minutes";

"MuteExpires.Hours_1" = "in 1 hour";
"MuteExpires.Hours_2" = "in 2 hours";
"MuteExpires.Hours_3_10" = "in %@ hours";
"MuteExpires.Hours_any" = "in %@ hours";

"MuteExpires.Days_1" = "in 1 day";
"MuteExpires.Days_2" = "in 2 days";
"MuteExpires.Days_3_10" = "in %@ days";
"MuteExpires.Days_any" = "in %@ days";

"SharedMedia.EmptyTitle" = "No media files yet";
"SharedMedia.EmptyText" = "Share photos and videos in this chat\n — or this paperclip stays unhappy.";
"SharedMedia.EmptyFilesText" = "You can send and receive\nfiles of any type up to 1.5 GB each\nand access them anywhere.";

"ShareFileTip.Title" = "Sharing Files";
"ShareFileTip.Text" = "You can share **uncompressed** media files from your Camera Roll here.\n\nTo share files of any other type, open them on your %@ (e.g. in your browser), tap **Open in...** or the action button and choose Telegram.";
"ShareFileTip.CloseTip" = "Close Tip";

"DialogList.SearchSectionDialogs" = "Chats and Contacts";
"DialogList.SearchSectionGlobal" = "Global Search";
"DialogList.SearchSectionMessages" = "Messages";

"Username.LinkHint" = "This link opens a chat with you in Telegram:[\nhttp://telegram.me/%@]";
"Username.LinkCopied" = "Copied link to clipboard";

"SharedMedia.ItemsSelected_1" = "1 Selected";
"SharedMedia.ItemsSelected_2" = "2 Selected";
"SharedMedia.ItemsSelected_3_10" = "%@ Selected";
"SharedMedia.ItemsSelected_any" = "%@ Selected";

"SharedMedia.DeleteItemsConfirmation_1" = "Delete media file?";
"SharedMedia.DeleteItemsConfirmation_2" = "Delete 2 media files?";
"SharedMedia.DeleteItemsConfirmation_3_10" = "Delete %@ media files?";
"SharedMedia.DeleteItemsConfirmation_any" = "Delete %@ media files?";

"PrivacySettings.Passcode" = "Passcode";
"PasscodeSettings.Title" = "Passcode";
"PasscodeSettings.TurnPasscodeOn" = "Turn Passcode On";
"PasscodeSettings.TurnPasscodeOff" = "Turn Passcode Off";
"PasscodeSettings.ChangePasscode" = "Change Passcode";
"PasscodeSettings.Help" = "When you set up an additional passcode, a lock icon will appear on the chats page. Tap it to lock and unlock the app.\n\nNote: if you forget the passcode, you'll need to delete and reinstall the app. All secret chats will be lost.";
"PasscodeSettings.UnlockWithTouchId" = "Unlock with Touch ID";
"PasscodeSettings.SimplePasscode" = "Simple Passcode";
"PasscodeSettings.SimplePasscodeHelp" = "A simple passcode is a 4 digit number.";
"PasscodeSettings.EncryptData" = "Encrypt Local Database";
"PasscodeSettings.EncryptDataHelp" = "Experimental feature, use with caution. Encrypt your local Telegram data, using a derivative of your passcode as the key.";

"EnterPasscode.EnterTitle" = "Enter your Telegram Passcode";
"EnterPasscode.SetupTitle" = "New Passcode";
"EnterPasscode.ChangeTitle" = "Change Passcode";
"EnterPasscode.EnterPasscode" = "Enter your Telegram Passcode";
"EnterPasscode.EnterNewPasscode" = "Enter your new passcode";
"EnterPasscode.RepeatNewPasscode" = "Re-enter your new passcode";
"EnterPasscode.EnterCurrentPasscode" = "Enter your current passcode";
"EnterPasscode.TouchId" = "Enter your passcode";

"DialogList.PasscodeLockHelp" = "Tap to lock Telegram";

"PasscodeSettings.AutoLock" = "Auto-Lock";
"PasscodeSettings.AutoLock.Disabled" = "Disabled";
"PasscodeSettings.AutoLock.IfAwayFor_1minute" = "If away for 1 min";
"PasscodeSettings.AutoLock.IfAwayFor_5minutes" = "If away for 5 min";
"PasscodeSettings.AutoLock.IfAwayFor_1hour" = "If away for 1 hour";
"PasscodeSettings.AutoLock.IfAwayFor_5hours" = "If away for 5 hours";

"PasscodeSettings.FailedAttempts_1" = "1 Failed Passcode Attempt";
"PasscodeSettings.FailedAttempts_2" = "2 Failed Passcode Attempts";
"PasscodeSettings.FailedAttempts_3_10" = "%@ Failed Passcode Attempts";
"PasscodeSettings.FailedAttempts_any" = "%@ Failed Passcode Attempt";
"PasscodeSettings.TryAgainIn1Minute" = "Try again in 1 minute";

"AccessDenied.Title" = "Please Allow Access";

"AccessDenied.Contacts" = "Telegram messaging is based on your existing contact list.\n\nPlease go to Settings > Privacy > Contacts and set Telegram to ON.";

"AccessDenied.VoiceMicrophone" = "Telegram needs access to your microphone to send voice messages.\n\nPlease go to Settings > Privacy > Microphone and set Telegram to ON.";

"AccessDenied.VideoMicrophone" = "Telegram needs access to your microphone to record sound in videos recording.\n\nPlease go to Settings > Privacy > Microphone and set Telegram to ON.";

"AccessDenied.MicrophoneRestricted" = "Microphone access is restricted for Telegram.\n\nPlease go to Settings > General > Restrictions > Microphone and set Telegram to ON.";


"AccessDenied.Camera" = "Telegram needs access to your camera to take photos and videos.\n\nPlease go to Settings > Privacy > Camera and set Telegram to ON.";

"AccessDenied.CameraRestricted" = "Camera access is restricted for Telegram.\n\nPlease go to Settings > General > Restrictions > Camera and set Telegram to ON.";

"AccessDenied.CameraDisabled" = "Camera access is globally restricted on your phone.\n\nPlease go to Settings > General > Restrictions and set Camera to ON";

"AccessDenied.PhotosAndVideos" = "Telegram needs access to your photo library to send photos and videos.\n\nPlease go to Settings > Privacy > Photos and set Telegram to ON.";

"AccessDenied.SaveMedia" = "Telegram needs access to your photo library to save photos and videos.\n\nPlease go to Settings > Privacy > Photos and set Telegram to ON.";

"AccessDenied.PhotosRestricted" = "Photo access is restricted for Telegram.\n\nPlease go to Settings > General > Restrictions > Photos and set Telegram to ON.";

"AccessDenied.LocationDenied" = "Telegram needs access to your location so that you can share it with your contacts.\n\nPlease go to Settings > Privacy > Location Services and set Telegram to ON.";

"AccessDenied.LocationDisabled" = "Telegram needs access to your location so that you can share it with your contacts.\n\nPlease go to Settings > Privacy > Location Services and set it to ON.";

"AccessDenied.Settings" = "Settings";

"WebSearch.RecentClearConfirmation" = "Are you sure you want to clear recent images?";

"FeatureDisabled.Oops" = "Oops";

"Conversation.ContextMenuReply" = "Reply";

"ForwardedMessages_1" = "Forwarded message";
"ForwardedMessages_2" = "2 forwarded messages";
"ForwardedMessages_3_10" = "%@ forwarded messages";
"ForwardedMessages_any" = "%@ forwarded messages";

"ForwardedFiles_1" = "Forwarded file";
"ForwardedFiles_2" = "2 forwarded files";
"ForwardedFiles_3_10" = "%@ forwarded files";
"ForwardedFiles_any" = "%@ forwarded files";

"ForwardedStickers_1" = "Forwarded sticker";
"ForwardedStickers_2" = "2 forwarded stickers";
"ForwardedStickers_3_10" = "%@ forwarded stickers";
"ForwardedStickers_any" = "%@ forwarded stickers";

"ForwardedPhotos_1" = "Forwarded photo";
"ForwardedPhotos_2" = "2 forwarded photos";
"ForwardedPhotos_3_10" = "%@ forwarded photos";
"ForwardedPhotos_any" = "%@ forwarded photos";

"ForwardedVideos_1" = "Forwarded video";
"ForwardedVideos_2" = "2 forwarded videos";
"ForwardedVideos_3_10" = "%@ forwarded videos";
"ForwardedVideos_any" = "%@ forwarded videos";

"ForwardedAudios_1" = "Forwarded audio";
"ForwardedAudios_2" = "2 forwarded audios";
"ForwardedAudios_3_10" = "%@ forwarded audios";
"ForwardedAudios_any" = "%@ forwarded audios";

"ForwardedLocations_1" = "Forwarded location";
"ForwardedLocations_2" = "2 forwarded locations";
"ForwardedLocations_3_10" = "%@ forwarded locations";
"ForwardedLocations_any" = "%@ forwarded locations";

"ForwardedContacts_1" = "Forwarded contact";
"ForwardedContacts_2" = "2 forwarded contacts";
"ForwardedContacts_3_10" = "%@ forwarded contacts";
"ForwardedContacts_any" = "%@ forwarded contacts";

"ForwardedAuthors2" = "%@, %@";
"ForwardedAuthorsOthers_1" = "%@ and 1 other";
"ForwardedAuthorsOthers_2" = "%@ and 2 others";
"ForwardedAuthorsOthers_3_10" = "%@ and %@ others";
"ForwardedAuthorsOthers_any" = "%@ and %@ others";
